{
  "branch": "root",
  "title": "Derivatives open source",
  "body": "Do you want to allow commercial use of your code? Permissive licenses (yes) allow derivative works to be licensed under any license, including proprietary licenses. Copyleft licenses (no) require derivative works to be licensed under the same license.",
  "children": [
    {
      "branch": "no",
      "title": "Network access",
      "body": "Is your software accessed over a network? AGPL (yes) requires that users who interact with the software over a network must be able to download the source code.",
      "children": [
        {
          "branch": "yes",
          "title": "AGPL (Network protection)",
          "body": "https://www.gnu.org/licenses/agpl-3.0.en.html"
        },
        {
          "branch": "no",
          "title": "Proprietary linking",
          "body": "Do you want to allow proprietary software to link to your code? If, for example, you write a library, LGPL (yes) allows for it to be used in proprietary software. More generally, it allows for proprietary software to link to LGPL-licensed software without open-sourcing the proprietary part.",
          "children": [
            {
              "branch": "yes",
              "title": "LGPL (Weak copyleft)",
              "body": "https://www.gnu.org/licenses/lgpl-3.0.html"
            },
            {
              "branch": "no",
              "title": "Specific ecosystem",
              "body": "Is your project tied to a specific ecosystem (e.g., Eclipse)? If yes, EPL 2.0 (yes) fits modular, ecosystem-friendly projects​. It allows the EPL-Licensed code to be combined with other code under a secondary license. Specifically, it allows to collectively release the code under the secondary license.",
              "children": [
                {
                  "branch": "yes",
                  "title": "EPL 2.0 (Ecosystem-friendly)",
                  "body": "https://www.eclipse.org/legal/epl-2.0/"
                },
                {
                  "branch": "no",
                  "title": "Creative work focus",
                  "body": "Is your project a creative work (e.g., art, music)? If yes, CC BY-SA (yes) is a copyleft license that is designed for creative works. It requires that derivative works be licensed under the same license, you have to be attributed as original author and what was changed if changes were made. If no, GPL (no) is a strong copyleft license that requires derivative works to be licensed under the same license.",
                  "children": [
                    {
                      "branch": "yes",
                      "title": "CC BY-SA (Copyleft, attribution)",
                      "body": "https://creativecommons.org/licenses/by-sa/4.0/"
                    },
                    {
                      "branch": "no",
                      "title": "GPL (Strong copyleft)",
                      "body": "https://www.gnu.org/licenses/gpl-3.0.en.html"
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },                      
    {
      "branch": "yes",
      "title": "Public domain",
      "body": "Do you want to release your code to the public domain? Unlicense (yes) is a public domain dedication that waives all copyright and related rights.",
      "children": [
        {
          "branch": "yes",
          "title": "Unlicense (no restrictions)",
          "body": "https://unlicense.org/"
        },
        {
          "branch": "no",
          "title": "Patent protection",
          "body": "Do you want to be proteced from contributors patenting their contributions in hindsight? Apache 2.0 (yes) is a permissive license that explicitly states that contributors who patent their contributions have to allow you to use those patents.",
          "children": [
            {
              "branch": "yes",
              "title": "Apache 2.0 (Patent grant)",
              "body": "https://www.apache.org/licenses/LICENSE-2.0.html"
            },
            {
              "branch": "no",
              "title": "Simplest license",
              "body": "Do you want the license to be easily understandable?",
              "children": [
                {
                  "branch": "yes",
                  "title": "Minimal text",
                  "body": "Do you want the license to be as short as possible? ISC (yes) is an ultra-simple permissive license that fits in a tweet. MIT (no) is a simple, very popular permissive license.",
                  "children": [
                    {
                      "branch": "yes",
                      "title": "ISC (Ultra-simple)",
                      "body": "https://www.isc.org/licenses/"
                    },
                    {
                      "branch": "no",
                      "title": "MIT (Simple, popular)",
                      "body": "https://mit-license.org/"
                    }
                  ]
                },
                {
                  "branch": "no",
                  "title": "Small library",
                  "body": "Is your project a small library? zLib (yes) is a lightweight permissive license that is often used in small libraries. It explicitly states that the original work and author must not be missrepresented by derivative work.",
                  "children": [
                    {
                      "branch": "yes",
                      "title": "zLib (Lightweight)"
                    },
                    {
                      "branch": "no",
                      "title": "Endorsement protection",
                      "body": "Do you want to prevent others from using your name to promote their products? BSD 3-Clause (yes) is a permissive license that requires that the original author is not endorsed by derivative works. BSD 2-Clause (no) is shorter by not including that non-endorsment clause.",
                      "children": [
                        {
                          "branch": "yes",
                          "title": "BSD 3-Clause (no endorsement)",
                          "body": "https://opensource.org/license/BSD-3-clause"
                        },
                        {
                          "branch": "no",
                          "title": "BSD 2-Clause (Simple)",
                          "body": "https://opensource.org/license/BSD-2-clause"
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}
  